dam_wall_1d/fluid-openfoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          30;
        startFace       2359;
    }
    outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          30;
        startFace       2389;
    }
    flap
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          21;
        startFace       2419;
    }
    upperWall
    {
        type            patch;
        nFaces          41;
        startFace       2440;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          40;
        startFace       2481;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          1220;
        startFace       2521;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          1220;
        startFace       3741;
    }
)

// ************************************************************************* //
